const menu = (prefix, NomeDoBot, sender) => {
  
// NÃO APAGUE ESSE ${NickDono} nem 
//${numerodn} nem ${NomeDoBot} nem ${prefix} só se quiser apagar completo, não coloque nada ${dentro assim} ISSO SÃO DEFINIÇÕES QUE ESTÁ PUXANDO DO settings.json, da pasta dono, só pode altera a base de tudo, menos as definições, só se quiser apagar a definição completa.  
  
return `​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​
⎙*BEM VINDO AO CHEROKEE BOT 1.0*

⬇️ Site: https://newschool.app 💜🐿️

⎙ *FIGURINHAS*

• ${prefix}s (marcar-foto)
• ${prefix}f (marcar-foto)
• ${prefix}attp (texto)
• ${prefix}attp2 (texto)
• ${prefix}sticker (marcar-foto)
• ${prefix}fsticker (marcar-foto)
• ${prefix}toimg (marcar-figu)
• ${prefix}togif (marcar-figu)
• ${prefix}rename (text/text)
• ${prefix}figgatos (fofin)


⎙*PESQUISAS/BAIXAR*

• ${prefix}Play (nome)
• ${prefix}Playdoc (nome)
• ${prefix}Youtube (link)
• ${prefix}Short (link)
• ${prefix}Ytmp4 (link) 
• ${prefix}Ytmp3 (link)
• ${prefix}Ytsearch (nome) 
• ${prefix}tiktok (link)
• ${prefix}instagram (link)
• ${prefix}Reels (link do rell)
• ${prefix}facebook (link)
• ${prefix}twitter (link)
• ${prefix}X (link) 
• ${prefix}Soundcloud (link)
• ${prefix}Spotify (link)
• ${prefix}letramusica (nome da música)
• ${prefix}playstore (newschool)
• ${prefix}aptoide_pesquisa (newschool)
• ${prefix}gerarlink (marcar)
• ${prefix}amazon (produto)
• ${prefix}Imgpralink (marcar img)
• ${prefix}videopralink (marcar video) 
• ${prefix}Wallpapers


⎙*JOGOS/QUIZ*

• ${prefix}Ppt (PEDRA/PAPEL/TESOURA) 
• ${prefix}Jogodavelha (@MARCAR) 
• ${prefix}Roleta
• ${prefix}tiro
• ${prefix}falta
• ${prefix}baterfalta
• ${prefix}Morte
• ${prefix}Simi (Oi) 
• ${prefix}Nana (Oi) 
• ${prefix}iniciar_forca
• ${prefix}jogodavelha (@marcar)
• ${prefix}Eununca



⎙*FUTEBOL*

• ${prefix}Tabela (20)
• ${prefix}Partidas
• ${prefix}Proxjogos
• ${prefix}Palpites


⎙*INFORMAÇÕES*

• ${prefix}Ping
• ${prefix}Atividade
• ${prefix}Rankativo
• ${prefix}Rankinativo
• ${prefix}Checkativo (@marcar)
• ${prefix}Celular (modelo)
• ${prefix}Dolarhoje
• ${prefix}Eurohoje
• ${prefix}Converter (Dolar/Euro + valor)
• ${prefix}Noticias
• ${prefix}Manchetes
• ${prefix}Clima (cidade)
• ${prefix}Signo
• ${prefix}moedas


⎙*DIVERSOS MENUS*

• ${prefix}Reportar (marcar msg)
• ${prefix}Menuadm
• ${prefix}Efeitosimg
• ${prefix}Logos
• ${prefix}sfundo (marcar ft)
• ${prefix}Noticias
• ${prefix}Gtts (pt + texto)
• ${prefix}Falar (pt + texto)
• ${prefix}Transcrever (marcar áudio/vídeo)
• ${prefix}Lerfoto (marcar ft)
• ${prefix}hidetag (marcar algo) 
• ${prefix}Conselhobiblico
• ${prefix}Perfil
• ${prefix}Calcular 1 + 1
• ${prefix}Anotações
`;
};

// MENU DE ADMINISTRADORES 

const adms = (prefix, sender) => { 
 
// NÃO APAGUE ESSE ${prefix}, não coloque nada ${dentro assim} ISSO SÃO DEFINIÇÕES QUE ESTÁ PUXANDO DO settings.json, da pasta dono, só pode altera a base de tudo, menos as definições, só se quiser apagar a definição completa. 

return `​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​

──────────────────────────────

🛠 **MENU DE ADMS** 🛠

Usuário: @${sender.split("@")[0]}

➡️ Use ${prefix}info nome do comando para obter informações detalhadas sobre um comando.

──────────────────────────────

**Configurações Gerais:**

• ${prefix}sorteio
• ${prefix}atividades
• ${prefix}multiprefixo
• ${prefix}duelo
• ${prefix}Bloqcmd (comando)

──────────────────────────────

**Gerenciamento de Membros:**

• ${prefix}listanegra (número)
• ${prefix}ban ( @usu ou responder a mensagem)
• ${prefix}promover [@] (Promover a Adm)

──────────────────────────────

**Configurações do Grupo:**

• ${prefix}grupo
• ${prefix}status
• ${prefix}linkgp
• ${prefix}grupoinfo
• ${prefix}descgp (txt)
• ${prefix}nomegp (nome)
• ${prefix}legenda_estrangeiro (msg)
• ${prefix}legenda_listanegra (msg)

──────────────────────────────

**Comandos de Marcação:**

• ${prefix}Marcar (marca todos do GP)
• ${prefix}Marcar2 (marca todos Wa.me/)
• ${prefix}Hidetag (txt) (marcação)
• ${prefix}Ausente (fale oq faz ou o que vai fazer)
• ${prefix}Ativo (Desativa o ausente)

──────────────────────────────

**Anti-Spam e Palavras:**

• ${prefix}limitarcomando
• ${prefix}tempocmd
• ${prefix}antipalavra
• ${prefix}limpar (texto invisível GP)

──────────────────────────────

**Tabelas e Notas:**

• ${prefix}anotações
• ${prefix}tabelagp

──────────────────────────────
`;
};

// MENU DE DONO

const menudono = (prefix, sender) => {
	
// NÃO APAGUE ESSE ${prefix}, não coloque nada ${dentro assim} ISSO SÃO DEFINIÇÕES QUE ESTÁ PUXANDO DO settings.json, da pasta dono, só pode alterar ele tod0, menos as definições, só se quiser apagar a definição completa. 	

return `​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​

──────────────────────────────

🔐 MENU DE DONO 🔐

Usuário: @${sender.split("@")[0]}

➡️ Use ${prefix}info [nome do comando] para obter informações detalhadas sobre um comando.

──────────────────────────────

**Configurações:**

• ${prefix}Configurar-bot

──────────────────────────────

**Comandos de Configuração:**

• ${prefix}Limitecaracteres
• ${prefix}Rgtm
• ${prefix}ListanegraG (número que saiu)
• ${prefix}Bemvindo
• ${prefix}Ativacoes_dono
• ${prefix}Bangp
• ${prefix}Fotomenu (marcar imagem) 
• ${prefix}Bloqcmdg (comando)
• ${prefix}Listagp
• ${prefix}Antiligar
• ${prefix}Ausente (fale oq faz ou o que vai fazer)
• ${prefix}Bloquear [@] (bloq de usar cmds) 
• ${prefix}Prefixo-bot (prefixo-novo)
• ${prefix}Antipv

──────────────────────────────

`;

};

// MENU DE LOGOS 

const menulogos = (prefix, sender) => {
  
// NÃO APAGUE ESSE ${prefix}, não coloque nada ${dentro assim} ISSO SÃO DEFINIÇÕES QUE ESTÁ PUXANDO DO settings.json, da pasta dono, só pode altera a base de tudo, menos as definições, só se quiser apagar a definição completa.  
  
return `​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​

──────────────────────────────

MENU DE LOGOS 🎨

Usuário: @${sender.split("@")[0]}

🔤 Logos de 1 Texto 🔤

• ${prefix}logos1 (txt)

──────────────────────────────
`;
};

// MENU DE ALTERAR ÁUDIOS E VÍDEOS

const alteradores = (prefix, sender) => {

// NÃO APAGUE ESSE ${prefix}, não coloque nada ${dentro assim} ISSO SÃO DEFINIÇÕES QUE ESTÁ PUXANDO DO settings.json, da pasta dono, só pode altera a base de tudo, menos as definições, só se quiser apagar a definição completa. 

return`

──────────────────────────────

🎥 **Alteradores de Áudio/Vídeo** 🎤

Usuário: @${sender.split("@")[0]}

──────────────────────────────

🎬 **Alterar Vídeos** 🎬

• ${prefix}Videolento (marca)
• ${prefix}Videorapido (marca)
• ${prefix}Videocontrario (marca)

──────────────────────────────

🔊 **Alterar Áudios** 🔊

• ${prefix}Audiolento (marca)
• ${prefix}Audiorapido (marca)
• ${prefix}Grave (marca)
• ${prefix}Grave2 (marca)
• ${prefix}Esquilo (marca)
• ${prefix}Estourar (marca)
• ${prefix}Bass (marca)
• ${prefix}Bass2 (marca)
• ${prefix}Vozmenino (marca)
• ${prefix}Audioreverse (marca)
• ${prefix}Paraaudio (marca o video)

──────────────────────────────

`;
};

// MENU PREMIUM 

const menuprem = (prefix, sender) => { 

// NÃO APAGUE ESSE ${prefix}, não coloque nada ${dentro assim} ISSO SÃO DEFINIÇÕES QUE ESTÁ PUXANDO DO settings.json, da pasta dono, só pode altera a base de tudo, menos as definições, só se quiser apagar a definição completa. 

return `

──────────────────────────────

💎 **Menu Premium** 💎

Usuário: @${sender.split("@")[0]}

──────────────────────────────

**Comandos Premium:**
• ADICIONE SEUS COMANDOS PREMIUM / VEJA O ${prefix}infopremium

──────────────────────────────

`;
};

// MENU DE BRINCADEIRAS.. 

const brincadeiras = (prefix, sender) => {

// NÃO APAGUE ESSE ${prefix}, não coloque nada ${dentro assim} ISSO SÃO DEFINIÇÕES QUE ESTÁ PUXANDO DO settings.json, da pasta dono, só pode altera a base de tudo, menos as definições, só se quiser apagar a definição completa. 

return `​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​

──────────────────────────────

🎉 **Menu de Brincadeiras** 🎉

Usuário: @${sender.split("@")[0]}

──────────────────────────────

**Brincadeiras com Marcações:**

*ESSE RECURSO FOI DESATIVADO AQUI*

──────────────────────────────

**Rankings e Classificações:**

*ESSE RECURSO FOI DESATIVADO AQUI*

──────────────────────────────

`;
};

// MENU DE EFEITOS DE IMAGEM, MONTAGEM Tops Kkk

const efeitos = (prefix, sender) => {

// NÃO APAGUE ESSE ${prefix}, não coloque nada ${dentro assim} ISSO SÃO DEFINIÇÕES QUE ESTÁ PUXANDO DO settings.json, da pasta dono, só pode altera a base de tudo, menos as definições, só se quiser apagar a definição completa. 

return `​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​

──────────────────────────────

📸 **Menu de Efeitos** 📸

Usuário: @${sender.split("@")[0]}

──────────────────────────────

**Efeitos em Imagens:**

• ${prefix}Legenda (marcar)-(img)
• ${prefix}Procurado (marcar)-(img)
• ${prefix}Preso (marcar)-(img)
• ${prefix}Deletem (marcar)-(img)
• ${prefix}Morto (marcar)-(img)

──────────────────────────────

`;
};

module.exports = {
menu, adms, menudono, menulogos, alteradores, menuprem, brincadeiras, efeitos
}
